# FloorType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Floor..::..FloorType Property
Floor Class See Also
---
Retrieves/sets an object that represents the type of the floor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FloorType FloorType { get; set; }
```

Visual Basic
---
```text
Public Property FloorType As FloorType
	Get
	Set
```

Visual C++
---
```text
public:
property FloorType^ FloorType {
	FloorType^ get ();
	void set (FloorType^ value);
}
```

# Remarks
The floor type can be used to access the multi layered structure of a floor.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: Floor type is not valid for this floor. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Floor Class
Autodesk.Revit.DB Namespace